In [73]:
import pandas as pd

import warnings
warnings.filterwarnings('ignore')

In [74]:
# To create a new data
# Define the data as a dictionary
data_dict = {
"CustomerID": [1001, 1002, 1003, 1004, 1005, 1005,1006],
"Gender": ["M", "F", None, "M", "F", "F","F"],
"Income": [75000, 40000, 10000000, 50000, 99999, 99999,45000],
"Age": [30, 40, 45, 20, 30, 30, None],
"MaritalStatus": ["M", "W", "s", "S", "D", "D","M"],
"Transaction Amount": ["5000", "4000", "7000", None, "3000", "3000","1000"],
"Date": ["12/1/2020", "12/2/2020", "12/3/2020", "12/4/2020", "12/5/2020","12/5/2020","12/6/2020"]
}

df = pd.DataFrame(data_dict)

In [75]:
df.head()

,CustomerID,Gender,Income,Age,MaritalStatus,Transaction Amount,Date
0,1001,M,75000,30.0,M,5000,12/1/2020
1,1002,F,40000,40.0,W,4000,12/2/2020
2,1003,None,10000000,45.0,s,7000,12/3/2020
3,1004,M,50000,20.0,S,None,12/4/2020
4,1005,F,99999,30.0,D,3000,12/5/2020

In [76]:
df.tail()

,CustomerID,Gender,Income,Age,MaritalStatus,Transaction Amount,Date
2,1003,None,10000000,45.0,s,7000,12/3/2020
3,1004,M,50000,20.0,S,None,12/4/2020
4,1005,F,99999,30.0,D,3000,12/5/2020
5,1005,F,99999,30.0,D,3000,12/5/2020
6,1006,F,45000,NaN,M,1000,12/6/2020

In [77]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 7 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   CustomerID          7 non-null      int64
 1   Gender              6 non-null      object
 2   Income              7 non-null      int64
 3   Age                 6 non-null      float64
 4   MaritalStatus       7 non-null      object
 5   Transaction Amount  6 non-null      object
 6   Date                7 non-null      object
dtypes: float64(1), int64(2), object(4)
memory usage: 524.0+ bytes

In [78]:
df.describe()

        CustomerID        Income        Age
count     7.000000  7.000000e+00   6.000000
mean   1003.714286  1.487143e+06  32.500000
std       1.799471  3.753900e+06   8.803408
min    1001.000000  4.000000e+04  20.000000
25%    1002.500000  4.750000e+04  30.000000
50%    1004.000000  7.500000e+04  30.000000
75%    1005.000000  9.999900e+04  37.500000
max    1006.000000  1.000000e+07  45.000000

In [79]:
print(df.shape)
print(df.columns)

(7, 7)
Index(['CustomerID', 'Gender', 'Income', 'Age', 'MaritalStatus',
       'Transaction Amount', 'Date'],
      dtype='object')

In [80]:
df["Gender"].unique()

array(['M', 'F', None], dtype=object)

In [81]:
df.nunique()   # check cardinality

CustomerID            6
Gender                2
Income                6
Age                   4
MaritalStatus         5
Transaction Amount    5
Date                  6
dtype: int64

In [82]:
df["Gender"].nunique()

2

In [83]:
df["Gender"].value_counts()

Gender
F    4
M    2
Name: count, dtype: int64

In [84]:
df.isnull().sum()

CustomerID            0
Gender                1
Income                0
Age                   1
MaritalStatus         0
Transaction Amount    1
Date                  0
dtype: int64

In [85]:
df.duplicated().sum()

1

In [86]:
df['Transaction Amount'] = pd.to_numeric(df['Transaction Amount'])

# Convert to datetime
df['Date'] = pd.to_datetime(df['Date'])

df['Gender'] = df['Gender'].astype('category')

In [87]:
df['year'] = df['Date'].dt.year
df['day_of_week'] = df['Date'].dt.dayofweek

In [88]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 9 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   CustomerID          7 non-null      int64
 1   Gender              6 non-null      category
 2   Income              7 non-null      int64
 3   Age                 6 non-null      float64
 4   MaritalStatus       7 non-null      object
 5   Transaction Amount  6 non-null      float64
 6   Date                7 non-null      datetime64[ns]
 7   year                7 non-null      int32
 8   day_of_week         7 non-null      int32
dtypes: category(1), datetime64[ns](1), float64(2), int32(2), int64(2), object(1)
memory usage: 655.0+ bytes

In [89]:
df['MaritalStatus'] = df['MaritalStatus'].str.upper()

In [90]:
df.sort_values('Age', ascending=False)

,CustomerID,Gender,Income,Age,MaritalStatus,Transaction Amount,Date,year,day_of_week
2,1003,NaN,10000000,45.0,S,7000.0,2020-12-03,2020,3
1,1002,F,40000,40.0,W,4000.0,2020-12-02,2020,2
0,1001,M,75000,30.0,M,5000.0,2020-12-01,2020,1
4,1005,F,99999,30.0,D,3000.0,2020-12-05,2020,5
5,1005,F,99999,30.0,D,3000.0,2020-12-05,2020,5
3,1004,M,50000,20.0,S,NaN,2020-12-04,2020,4
6,1006,F,45000,NaN,M,1000.0,2020-12-06,2020,6

In [91]:
# Group by 'Gender' and calculate mean Age
df.groupby('Gender')['Age'].mean()

Gender
F    33.333333
M    25.000000
Name: Age, dtype: float64

In [92]:
# Multiple aggregations
df.groupby('Gender').agg({'Age': ['mean', 'min', 'max']})

              Age
             mean   min   max
Gender
F       33.333333  30.0  40.0
M       25.000000  20.0  30.0

In [93]:
df[df['Age'] > 30]

,CustomerID,Gender,Income,Age,MaritalStatus,Transaction Amount,Date,year,day_of_week
1,1002,F,40000,40.0,W,4000.0,2020-12-02,2020,2
2,1003,NaN,10000000,45.0,S,7000.0,2020-12-03,2020,3

In [94]:
df[(df['Age'] > 25) & (df['Gender'] == 'M')]

,CustomerID,Gender,Income,Age,MaritalStatus,Transaction Amount,Date,year,day_of_week
0,1001,M,75000,30.0,M,5000.0,2020-12-01,2020,1

In [95]:
Cdf = df.copy().dropna()
Cdf

,CustomerID,Gender,Income,Age,MaritalStatus,Transaction Amount,Date,year,day_of_week
0,1001,M,75000,30.0,M,5000.0,2020-12-01,2020,1
1,1002,F,40000,40.0,W,4000.0,2020-12-02,2020,2
4,1005,F,99999,30.0,D,3000.0,2020-12-05,2020,5
5,1005,F,99999,30.0,D,3000.0,2020-12-05,2020,5

In [96]:
df["Transaction Amount"].fillna(0, inplace=True)
df

,CustomerID,Gender,Income,Age,MaritalStatus,Transaction Amount,Date,year,day_of_week
0,1001,M,75000,30.0,M,5000.0,2020-12-01,2020,1
1,1002,F,40000,40.0,W,4000.0,2020-12-02,2020,2
2,1003,NaN,10000000,45.0,S,7000.0,2020-12-03,2020,3
3,1004,M,50000,20.0,S,0.0,2020-12-04,2020,4
4,1005,F,99999,30.0,D,3000.0,2020-12-05,2020,5
5,1005,F,99999,30.0,D,3000.0,2020-12-05,2020,5
6,1006,F,45000,NaN,M,1000.0,2020-12-06,2020,6

In [97]:
df["Age"].fillna(method="ffill", inplace=True)
df

,CustomerID,Gender,Income,Age,MaritalStatus,Transaction Amount,Date,year,day_of_week
0,1001,M,75000,30.0,M,5000.0,2020-12-01,2020,1
1,1002,F,40000,40.0,W,4000.0,2020-12-02,2020,2
2,1003,NaN,10000000,45.0,S,7000.0,2020-12-03,2020,3
3,1004,M,50000,20.0,S,0.0,2020-12-04,2020,4
4,1005,F,99999,30.0,D,3000.0,2020-12-05,2020,5
5,1005,F,99999,30.0,D,3000.0,2020-12-05,2020,5
6,1006,F,45000,30.0,M,1000.0,2020-12-06,2020,6

In [98]:
df.drop_duplicates(inplace=True)

## Applying functions to data frames

### Performance Considerations

- **Vectorized operations** (native Pandas/Numpy) are **fastest**
- `apply()` is flexible but **slower** (~50× slower than vectorized)
- `applymap()` is **slowest** - avoid for large DataFrames
- **Cythonized functions** (via `numexpr`, `numba`) can speed up custom operations

### When to Use Each Method

| Use Case | Recommended Method |
|----------|-------------------|
| Simple math operations | Vectorized (`df['col'] * 2`) |
| Row/column-wise functions | `apply()` |
| Element-wise functions | `applymap()` (small data) or vectorized |
| Group operations | `transform()` or `agg()` |
| Complex pipelines | `pipe()` |

In [111]:
import pandas as pd
import numpy as np

df = pd.DataFrame({
    'A': [1, 2, 3],
    'B': [4, 5, 6]
})

df

   A  B
0  1  4
1  2  5
2  3  6

In [112]:
# Apply to each column (default axis=0)
df.apply(np.sum)  # Returns sum of each column

A     6
B    15
dtype: int64

In [113]:
# Apply to each row (axis=1)
df.apply(np.sum, axis=1)  # Returns sum of each row

0    5
1    7
2    9
dtype: int64

In [114]:
# With custom function
def multiply_by_two(x):
    return x * 2

df.apply(multiply_by_two)  # Applies to each element

   A   B
0  2   8
1  4  10
2  6  12

In [115]:
df*2

   A   B
0  2   8
1  4  10
2  6  12

In [103]:
# Apply function to every single element
df.applymap(lambda x: x**2)  # Squares every value

# Equivalent to (but slower than vectorized operations):
df ** 2

   A   B
0  1  16
1  4  25
2  9  36

## Some groupby examples

In [104]:
data = {
    'Company': ['Google', 'Google', 'Meta', 'Meta', 'Apple', 'Apple'],
    'Employee': ['Alice', 'Bob', 'Charlie', 'David', 'Eve', 'Frank'],
    'Salary': [120000, 110000, 130000, 125000, 140000, 145000]
}

df = pd.DataFrame(data)

# Group by Company and calculate mean salary
df.groupby('Company')['Salary'].mean()

Company
Apple     142500.0
Google    115000.0
Meta      127500.0
Name: Salary, dtype: float64

In [105]:
# Define a custom function
def salary_range(series):
    return series.max() - series.min()

# Apply it to groupby
df.groupby('Company')['Salary'].agg(salary_range)

Company
Apple      5000
Google    10000
Meta       5000
Name: Salary, dtype: int64

In [106]:
# Get the highest-paid employee in each company
def top_earner(group):
    return group.nlargest(1, 'Salary')

df.groupby('Company').apply(top_earner)

          Company Employee  Salary
Company
Apple   5   Apple    Frank  145000
Google  0  Google    Alice  120000
Meta    2    Meta  Charlie  130000

In [107]:
# Example with sales data
sales = {
    'Region': ['East', 'East', 'West', 'West', 'East', 'West'],
    'Product': ['A', 'B', 'A', 'B', 'A', 'B'],
    'Revenue': [100, 150, 200, 120, 300, 180]
}

sales_df = pd.DataFrame(sales)

# Group by Region AND Product
sales_df.groupby(['Region', 'Product'])['Revenue'].sum()

Region  Product
East    A          400
        B          150
West    A          200
        B          300
Name: Revenue, dtype: int64

## Task

In [117]:
df = pd.read_csv(r"c:\Users\Mohamed Walied\Downloads\Data.csv")
# df.set_index('id', inplace=True)
df.head()

,id,name,department,salary,join_date,performance_score,projects_completed,is_manager
0,1,John Doe,Engineering,75000.0,5/15/2020,87.5,5,True
1,2,Jane Smith,Marketing,68000.0,11/3/2019,NaN,3,False
2,3,Robert Johnson,Engineering,82000.0,3/22/2018,92.1,7,True
3,4,Jane Smith,Marketing,68000.0,11/3/2019,78.3,3,False
4,5,Sarah Williams,Sales,NaN,7/10/2021,85.0,4,False